01Hub/fbedit/STM32F4Discovery/STM32F4_LCMeter/STM32_LCMeter/main.c
/**
  ******************************************************************************
  * @file    LCMeter/main.c 
  * @author  KO
  * @version V1.0.0
  * @date    20-February-2014
  * @brief   Main program body
  ******************************************************************************
  */

/**
  ******************************************************************************
  Port pins
  PA.00           Frequency counter scope input (TIM5)
  PA.01           Frequency counter input (TIM2)
  PA.04           Scope V-Pos DAC1 Output
  PA.05           Scope trigger position  DAC2 Output
  PB.07           High Speed Clock
  PB.13           SPI SCK
  PB.15           SPI MOSI
  PC.01           Scope ADC
  PD.00           Frequency counter select0
  PD.01           Frequency counter select1
  PD.02           Frequency counter select2
  PD.06           LCMeter L/C selection, C = Low L = High
  PD.07           LCMeter calibration
  PD.08           USART3 TX
  PD.09           USART3 RX
  PE.03			      Scope X10 Output OD
  PE.04			      Scope X5 Output OD
  PE.05			      Scope X10 Output OD
  PE.08 to PE.15  LGA Inputs
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f4_discovery.h"

/* Private typedef -----------------------------------------------------------*/
typedef struct
{
  uint32_t HSCSet;
  uint32_t HSCDiv;
} STM32_HSCTypeDef;

typedef struct
{
  uint32_t Frequency;
  uint32_t FrequencySCP;
} STM32_FRQTypeDef;

typedef struct
{
  uint32_t FrequencyCal0;
  uint32_t FrequencyCal1;
} STM32_LCMTypeDef;

typedef struct
{
  uint32_t ADC_Prescaler;
  uint32_t ADC_TwoSamplingDelay;
  uint32_t ScopeTrigger;
  uint32_t ScopeTriggerLevel;
  uint32_t ScopeTimeDiv;
  uint16_t ScopeVoltDiv;
  uint16_t ScopeMag;
  uint32_t ScopeVPos;
  uint32_t ADC_TripleMode;
  uint32_t ADC_SampleTime;
  uint32_t ADC_SampleSize;
  uint32_t SubSampling;
} STM32_SCPTypeDef;

typedef struct
{
  uint8_t SampleRateSet;
  uint8_t PixDiv;
  uint8_t nDiv;
  uint8_t Mag;
  uint8_t SubSampling;
  uint8_t Trigger;
  uint8_t Triple;
  uint8_t Auto;
  uint16_t TriggerLevel;
  uint16_t VPos;
  uint32_t TimeDiv;
  uint32_t SampleRate;
} STM32_SCP2TypeDef;

typedef struct
{
  uint16_t DDS_Cmd;
  uint16_t DDS_Wave;
  uint32_t DDS__PhaseAdd;
  uint32_t DDS_Amplitude;
  uint32_t DDS_DCOffset;
	uint16_t SWEEP_Mode;
	uint16_t SWEEP_Time;
	uint32_t SWEEP_Step;
	uint32_t SWEEP_Min;
	uint32_t SWEEP_Max;
} STM32_DDSTypeDef;

typedef struct
{
  uint8_t DataBlocks;
  uint8_t TriggerValue;
  uint8_t TriggerMask;
  uint8_t TriggerWait;
  uint16_t LGASampleRateDiv;
  uint16_t LGASampleRate;
} STM32_LGATypeDef;


typedef struct
{
  uint32_t Cmd;
  STM32_HSCTypeDef STM32_HSC;
  STM32_FRQTypeDef STM32_FRQ;
  STM32_LCMTypeDef STM32_LCM;
  STM32_SCPTypeDef STM32_SCP;
  STM32_DDSTypeDef STM32_DDS;
  STM32_LGATypeDef STM32_LGA;
  STM32_SCP2TypeDef STM32_SCP2;
  uint32_t TickCount;
  uint32_t PreviousCountTIM2;
  uint32_t ThisCountTIM2;
  uint32_t PreviousCountTIM5;
  uint32_t ThisCountTIM5;
  char BTBuff[64];
} STM32_CMDTypeDef;

/* Private define ------------------------------------------------------------*/
/* Main commands */
#define CMD_DONE                                ((uint8_t)0)
#define CMD_LCMCAL                              ((uint8_t)1)
#define CMD_LCMCAP                              ((uint8_t)2)
#define CMD_LCMIND                              ((uint8_t)3)
#define CMD_FRQCH1                              ((uint8_t)4)
#define CMD_FRQCH2                              ((uint8_t)5)
#define CMD_FRQCH3                              ((uint8_t)6)
#define CMD_SCPSET                              ((uint8_t)7)
#define CMD_HSCSET                              ((uint8_t)8)
#define CMD_DDSSET                              ((uint8_t)9)
#define CMD_LGASET                              ((uint8_t)10)
#define CMD_WAVEUPLOAD                          ((uint8_t)11)
#define CMD_SCP2SET                             ((uint8_t)12)

/* DDS sub commands */
#define DDS_PHASESET                            ((uint8_t)1)
#define DDS_WAVESET                             ((uint8_t)2)
#define DDS_SWEEPSET                            ((uint8_t)3)
#define DDS_WAVEUPLOAD                          ((uint8_t)4)

/* DDS sweep modes */
#define SWEEP_ModeOff                           ((uint8_t)0)
#define SWEEP_ModeUp                            ((uint8_t)1)
#define SWEEP_ModeDown                          ((uint8_t)2)
#define SWEEP_ModeUpDown                        ((uint8_t)3)

/* Misc */
#define ADC_CDR_ADDRESS                         ((uint32_t)0x40012308)
#define PE_IDR_Address                          ((uint32_t)0x40021011)
#define SCOPE_MAXSAMPLESIZE                     ((uint32_t)0xFFFC)
#define SCOPE_DATAPTR                           ((uint32_t)0x20008000)
#define SCOPE_MAXWAVESIZE                       ((uint32_t)0x1000)
#define SCOPE_WAVEPTR                           ((uint32_t)0x20018000)
#define SCOPE_COUNTPTR                          ((uint32_t)(SCOPE_WAVEPTR + SCOPE_MAXWAVESIZE * 4))
#define LGA_DATAPTR                             ((uint32_t)0x20008000)
#define WAVE_DATAPTR                            ((uint32_t)0x20008000)
#define STM32_CLOCK                             ((uint32_t)200000000)
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
__IO STM32_CMDTypeDef STM32_CMD;                // 0x20000014
__IO uint32_t SampleSize;

/* Private function prototypes -----------------------------------------------*/
void RCC_Config(void);
void NVIC_Config(void);
void GPIO_Config(void);
void TIM_Config(void);
void DAC_Config(void);
void DMA_SingleConfig(uint32_t SampleSize);
void ADC_SingleConfig(uint32_t Prescaler, uint32_t SampleTime);
void DMA_TripleConfig(uint32_t SampleSize);
void ADC_TripleConfig(uint32_t Prescaler, uint32_t TwoSamplingDelay);
void SPI_Config(void);
void USART_Config(uint32_t Baud);
void ScopeSubSampling(void);
uint32_t GetFrequency(void);
void LCM_Calibrate(void);
void SPISendData32(uint32_t tx);
void SPISendData(uint16_t tx);
void USART3_putdata(uint8_t *dat,uint16_t len);
void USART3_puts(char *str);
void USART3_getdata(uint8_t *dat,uint16_t len);
void DMA_LGAConfig(void);
void SendCompressedBuffer(uint32_t *in,uint16_t len);
uint32_t GetScopeSampleSize(void);
void ScopeResetWave(uint32_t *ptr,uint32_t len);
void ScopeSetWaveData(uint32_t *ptrwave,uint32_t *ptrcount,uint16_t *ptrsample);
void ScopeLineTo(int16_t X1, int16_t Y1, int16_t X2, int16_t Y2, uint16_t *ptrsample);
uint32_t ScopeFindTrigger(uint16_t *ptrsample);
/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void) {
  __IO uint16_t i;
  __IO uint16_t *ptr;
  __IO uint16_t tmp1;
  __IO uint16_t tmp2;
  uint32_t scpcnt;
  uint32_t scpwait;
  uint32_t scptpos;
  /* RCC Configuration */
  RCC_Config();
  /* GPIO Configuration */
  GPIO_Config();
  /* TIM Configuration */
  TIM_Config();
  /* NVIC Configuration */
  NVIC_Config();
  /* DAC Configuration */
  DAC_Config();
  /* SPI Configuration */
  SPI_Config();
  /* USART Configuration */
  USART_Config(115200);
  /* Calibrate LC Meter */
  LCM_Calibrate();

