01Hub/fbedit/STM32F4Discovery/STM32F4_LCMeter/STM32_LCMeter/main.c
  Dx = (X2-X1);
  Dy = (Y2-Y1);

  TwoDx = Dx + Dx;
  TwoDy = Dy + Dy;

  CurrentX = X1;
  CurrentY = Y1;

  Xinc = 1;
  Yinc = 1;

  if(Dx < 0) {
    Xinc = -1;
    Dx = -Dx;
    TwoDx = -TwoDx;
  }

  if (Dy < 0) {
    Yinc = -1;
    Dy = -Dy;
    TwoDy = -TwoDy;
  }
  //SetPixel(X1,Y1, c);
  ptrsample[X1] = Y1;

  if ((Dx != 0) || (Dy != 0)) {
    if (Dy <= Dx) { 
      TwoDxAccumulatedError = 0;
      do {
        CurrentX += Xinc;
        TwoDxAccumulatedError += TwoDy;
        if(TwoDxAccumulatedError > Dx) {
          CurrentY += Yinc;
          TwoDxAccumulatedError -= TwoDx;
        }
        //SetPixel(CurrentX,CurrentY, c);
        ptrsample[CurrentX] = CurrentY;
      } while (CurrentX != X2);
    } else {
      TwoDyAccumulatedError = 0; 
      do {
        CurrentY += Yinc; 
        TwoDyAccumulatedError += TwoDx;
        if(TwoDyAccumulatedError>Dy) {
          CurrentX += Xinc;
          TwoDyAccumulatedError -= TwoDy;
        }
        //SetPixel(CurrentX,CurrentY, c);
        ptrsample[CurrentX] = CurrentY;
      } while (CurrentY != Y2);
    }
  }
}

/**
  * @brief  Find rrigger position.
  * @param  Pointer to samples
  * @retval Trigger position
  */
uint32_t ScopeFindTrigger(uint16_t *ptrsample) {
  __IO uint32_t tpos;
  tpos = 250;
  if (STM32_CMD.STM32_SCP2.Trigger == 1) {
    /* Rising */
    while (tpos < SCOPE_MAXWAVESIZE - 250) {
      if (ptrsample[tpos] <= STM32_CMD.STM32_SCP2.TriggerLevel && ptrsample[tpos + 1] >= STM32_CMD.STM32_SCP2.TriggerLevel) {
        return tpos - 250;
      }
      tpos++;
    }
  } else {
    /* falling */
    while (tpos < SCOPE_MAXWAVESIZE - 250) {
      if (ptrsample[tpos] >= STM32_CMD.STM32_SCP2.TriggerLevel && ptrsample[tpos + 1] <= STM32_CMD.STM32_SCP2.TriggerLevel) {
        return tpos - 250;
      }
      tpos++;
    }
  }
  /* Trigger not found */
  return 0;
}

/**
  * @brief  ADC data is 12 bits so 2 halfwords (4 bytes) is compressed into 3 bytes.
  * @param  Pointer to buffer, buffer size
  * @retval None
  */
void SendCompressedBuffer(uint32_t *in,uint16_t len) {
  __IO uint32_t dat32;
  __IO uint8_t dat8;
  while  (len--) {
    dat32 = *in;
    dat32 = ((dat32 >> 4) & 0x00fff000) | (dat32 & 0xfff);

    /* Wait until transmit register empty */
    while((USART3->SR & USART_FLAG_TXE) == 0);
    /* Transmit Data */
    dat8 = dat32;
    USART3->DR = (uint16_t)dat8;

    /* Wait until transmit register empty */
    while((USART3->SR & USART_FLAG_TXE) == 0);
    /* Transmit Data */
    dat8 = dat32 >> 8;
    USART3->DR = (uint16_t)dat8;

    /* Wait until transmit register empty */
    while((USART3->SR & USART_FLAG_TXE) == 0);
    /* Transmit Data */
    dat8 = dat32 >> 16;
    USART3->DR = (uint16_t)dat8;

    *in++;
  }
}

/**
  * @brief  Get frequency reading.
  * @param  None
  * @retval None
  */
uint32_t GetFrequency(void) {
  uint32_t i;
  i = STM32_CMD.TickCount;
  while (i == STM32_CMD.TickCount);
  return STM32_CMD.STM32_FRQ.Frequency;
}

/**
  * @brief  Calibrate LC Meter.
  * @param  None
  * @retval None
  */
void LCM_Calibrate(void) {
  uint32_t i;
  GPIO_ResetBits(GPIOD, GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_6 | GPIO_Pin_7);
  STM32_CMD.STM32_LCM.FrequencyCal0 = 0;
  STM32_CMD.STM32_LCM.FrequencyCal1 = 0;
  i = GetFrequency();
  i = 0;
  while (i < 4) {
    STM32_CMD.STM32_LCM.FrequencyCal0 += GetFrequency();
    i++;
  }
  STM32_CMD.STM32_LCM.FrequencyCal0 /= 4;
  GPIO_SetBits(GPIOD, GPIO_Pin_7);
  i = GetFrequency();
  i = 0;
  while (i < 4) {
    STM32_CMD.STM32_LCM.FrequencyCal1 += GetFrequency();
    i++;
  }
  STM32_CMD.STM32_LCM.FrequencyCal1 /= 4;
  GPIO_ResetBits(GPIOD, GPIO_Pin_7);
}

/**
  * @brief  SPI Send 32 bit data.
  * @param  tx
  * @retval None
  */
void SPISendData32(uint32_t tx) {
  SPISendData(tx);
  SPISendData(tx >> 16);
}

/**
  * @brief  SPI Send 16 bit data.
  * @param  tx
  * @retval None
  */
void SPISendData(uint16_t tx) {
	SPI2->DR = tx;                            // write data to be transmitted to the SPI data register
	while (!(SPI2->SR & SPI_I2S_FLAG_TXE));   // wait until transmit complete
  while (SPI2->SR & SPI_I2S_FLAG_BSY);      // wait until SPI is not busy anymore
}

/**
  * @brief  USART3 send byte array.
  * @param  pointer to array, lenght
  * @retval None
  */
void USART3_putdata(uint8_t *dat,uint16_t len) {
  /* Data are transmitted one byte at a time. */
  while (len--) {
    /* Wait until transmit register empty */
    while((USART3->SR & USART_FLAG_TXE) == 0);          
    /* Transmit Data */
    USART3->DR = (uint16_t)*dat;
    *dat++;
  }
}

/**
  * @brief  USART3 send string.
  * @param  Zero terminated string
  * @retval None
  */
void USART3_puts(char *str) {
  char c;
  /* Characters are transmitted one at a time. */
  while ((c = *str++)) {
    /* Wait until transmit register empty */
    while((USART3->SR & USART_FLAG_TXE) == 0);
    /* Transmit Data */
    USART3->DR = (uint16_t)c;
  }
}

/**
  * @brief  USART3 receives byte array.
  * @param  pointer to array, lenght
  * @retval None
  */
void USART3_getdata(uint8_t *dat,uint16_t len) {
  /* Data are recieved one byte at a time. */
  while (len--) {
    /* Wait until receive register not empty */
    while((USART3->SR & USART_FLAG_RXNE) == 0);          
    /* Receive Data */
    *dat = (uint8_t)USART3->DR;
    *dat++;
  }
  // STM_EVAL_LEDToggle(LED4);
}

/**
  * @brief  Configure the RCC.
  * @param  None
  * @retval None
  */
void RCC_Config(void) {
  /* SPI2, DAC, TIM2, TIM3, TIM4 and TIM5 clock enable */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2 | RCC_APB1Periph_DAC | RCC_APB1Periph_TIM2 | RCC_APB1Periph_TIM3 | RCC_APB1Periph_TIM4 | RCC_APB1Periph_TIM5, ENABLE);
  /* DMA2 clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);
  /* GPIOA clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
  /* GPIOB clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
  /* GPIOC clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
  /* GPIOD clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);
  /* GPIOE clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);
  /* USART3 clock enable */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE); 
  /* Enable TIM8, ADC1, ADC2 and ADC3 clocks */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM8 | RCC_APB2Periph_ADC1 | RCC_APB2Periph_ADC2 | RCC_APB2Periph_ADC3, ENABLE);
}

/**
  * @brief  Configure the NVIC.
  * @param  None
  * @retval None
  */
void NVIC_Config(void) {
  NVIC_InitTypeDef NVIC_InitStructure;
  /* Enable the TIM3 gloabal Interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
}

/**
  * @brief  Configure the GPIO.
  * @param  None
  * @retval None
  */
void GPIO_Config(void) {
  GPIO_InitTypeDef GPIO_InitStructure;
  /* Initialize Leds mounted on STM32F4-Discovery board */
  STM_EVAL_LEDInit(LED3);
  STM_EVAL_LEDInit(LED4);

  /* TIM2 chennel2 configuration : PA.01 */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  /* Connect TIM2 pin to AF2 */
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource1, GPIO_AF_TIM2);

  /* TIM5 chennel1 configuration : PA.00 */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  /* Connect TIM5 pin to AF2 */
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource0, GPIO_AF_TIM5);

  /* TIM4 chennel 2 configuration : PB7 */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP ;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  /* Connect TIM4 pin to AF2 */
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_TIM4);

  /* Configure ADC123 Channel 11 pin as analog input (Scope) */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL ;
  GPIO_Init(GPIOC, &GPIO_InitStructure);

